Program verbal_number;
{Дано целое число в диапазоне 100-999. Вывести строку-словесное описание данного
числа, например:256-"двести пятьдесят шесть", 814-"восемьсот четырнадцать".}

const

     c1: array [1..9] of string[6] = (
     'один',
     'два',
     'три',
     'четыре',
     'пять',
     'шесть',
     'семь',
     'восемь',
     'девять'
     );

     c11: array [0..9] of string[12] = (
      'десять',
      'одиннадцать',
      'двенадцать',
      'тринадцать',
      'четырнадцать',
      'пятнадцать',
      'шестнадцать',
      'семнадцать',
      'восемнадцать',
      'девятнадцать'
     );

     c20: array [2..9] of string[9] = (
     'двадцать',
     'тридцать',
     'сорок',
     'пятьдесят',
     'шестьдесят',
     'семьдесят',
     'восемьдесят',
     'девяносто'
     );

     c100: array [1..9] of string[9] = (
     'сто',
     'двести',
     'триста',
     'четыреста',
     'пятьсот',
     'шестьсот',
     'семьсот',
     'восемьсот',
     'девятьсот'
     );


var x,y,z: String;
    s1,s2,s3:Char;
begin
     WriteLn;
     Write ('Введите целое число в диапазоне (100-999): ');
     ReadLn (s1, s2, s3);

     x := c100 [ord(s1) - ord('0')];

     if s2 = '1' then
     begin
        y := c11 [ord(s3) - ord('0')];
        z := '';
     end
     else
     if s2 <> '0' then
     begin
        y := c20 [ord(s2) - ord('0')];
        if s3 <> '0' then
           z :=  c1 [ord(s3) - ord('0')]
        else
           z := '';
     end
     else
     begin
        y := '';
        if s3 <> '0' then
           z := c1 [ord(s3) - ord('0')]
        else z := '';
     end;

     WriteLn('Словесное описание: ', x+' '+y+' '+z);
     readln;
end.